In [1]:
import pandas as pd

In [2]:
data = {
    'Employee': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie', 'Alice', 'Charlie', 'Bob'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'North'],
    'Sales': [200, 150, 300, 400, 100, 250, 300, 350],
    'Year': [2023, 2023, 2024, 2024, 2023, 2024, 2024, 2023]
}

In [3]:
df = pd.DataFrame(data)
df

  Employee Region  Sales  Year
0    Alice  North    200  2023
1      Bob  South    150  2023
2    Alice  North    300  2024
3      Bob  South    400  2024
4  Charlie  North    100  2023
5    Alice  South    250  2024
6  Charlie  North    300  2024
7      Bob  North    350  2023

1. Group the data by Employee and calculate the total sales for each employee. (5 Marks)  
2. Group the data by Region and find the average sales per region. (5 Marks)  
3. Group the data by both Employee and Year to calculate the total sales for each combination. (10 Marks)

In [4]:
#Grouping the data by Employee and calculating the total sales for each employee
employee_sales = df.groupby('Employee')['Sales'].sum()
employee_sales

Employee
Alice      750
Bob        900
Charlie    400
Name: Sales, dtype: int64

In [5]:
#Grouping by region and finding the average sales
region_avg_sales = df.groupby('Region')['Sales'].mean()
region_avg_sales

Region
North    250.000000
South    266.666667
Name: Sales, dtype: float64

In [6]:
#Grouping the data by both Employee and Year then calculating the total sales for each combination
employee_year_sales = df.groupby(['Employee', 'Year'])['Sales'].sum()
employee_year_sales

Employee  Year
Alice     2023    200
          2024    550
Bob       2023    500
          2024    400
Charlie   2023    100
          2024    300
Name: Sales, dtype: int64

In [7]:
employee_details = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Department': ['Sales', 'Sales', 'Marketing', 'HR']
})
employee_details

  Employee  Age Department
0    Alice   25      Sales
1      Bob   30      Sales
2  Charlie   35  Marketing
3    David   40         HR

In [8]:
sales_targets = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Sales_Target': [1000, 1200, 800, 500]
})
sales_targets

  Employee  Sales_Target
0    Alice          1000
1      Bob          1200
2  Charlie           800
3    David           500

1. Merge the two datasets on the Employee column to combine all details. (10 Marks)  
2. Create a new column showing the difference between Sales_Target and total sales (calculated from Task 1). Hint: Use the merged dataset for calculations. (10 Marks)

In [9]:
#Merging the two datasets on the Employee column to combine all details
merged = pd.merge(employee_details, sales_targets, on = 'Employee')
merged

  Employee  Age Department  Sales_Target
0    Alice   25      Sales          1000
1      Bob   30      Sales          1200
2  Charlie   35  Marketing           800
3    David   40         HR           500

In [10]:
#Create a new column showing the difference between Sales_Target and total sales
merged_sales = pd.merge(merged,employee_sales,on = 'Employee',how ='left').fillna(0)
merged_sales['Sales_Difference']=merged_sales['Sales_Target']-merged_sales['Sales']
merged_sales

  Employee  Age Department  Sales_Target  Sales  Sales_Difference
0    Alice   25      Sales          1000  750.0             250.0
1      Bob   30      Sales          1200  900.0             300.0
2  Charlie   35  Marketing           800  400.0             400.0
3    David   40         HR           500    0.0             500.0

In [11]:
stock_prices = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'Price': [100, 102, 105, 107, 110]
})
stock_prices

         Date  Price
0  2024-01-01    100
1  2024-01-02    102
2  2024-01-03    105
3  2024-01-04    107
4  2024-01-05    110

1. Convert the Date column to a datetime object. (5 Marks)
2. Resample the data to calculate the weekly average price. (10 Marks)
3. Find the day with the highest stock price. (5 Marks)

In [12]:
#Converting the Date column to a datetime object
stock_prices['Date'] = pd.to_datetime(stock_prices['Date'])
stock_prices

        Date  Price
0 2024-01-01    100
1 2024-01-02    102
2 2024-01-03    105
3 2024-01-04    107
4 2024-01-05    110

In [13]:
#Resampling the data to calculate the weekly average price.
stock_prices.set_index('Date', inplace=True)
weekly_avg_price = stock_prices.resample('W').mean()
weekly_avg_price

            Price
Date
2024-01-07  104.8

In [14]:
#Finding the day with the highest stock price
highest_price_day = stock_prices[stock_prices['Price'] == stock_prices['Price'].max()]
highest_price_day

            Price
Date
2024-01-05    110

1. Create a pivot table to find the total sales by Region and Year. (10 Marks)
2. Create a cross-tabulation showing the count of employees working in each Region for each Year. (10 Marks)

In [15]:
pivot_table = df.pivot_table(values='Sales', index='Region', columns='Year', aggfunc='sum')
pivot_table

Year    2023  2024
Region
North    650   600
South    150   650

In [16]:
cross_tab = pd.crosstab(df['Region'], df['Year'])
cross_tab

Year    2023  2024
Region
North      3     2
South      1     2

1. Save the final merged dataset (from Task 2) to a CSV file named employee_sales.csv. (5 Marks)
2. Save the pivot table (from Task 4) to an Excel file named sales_summary.xlsx. (5 Marks)

In [17]:
merged_sales.to_csv('employee_sales.csv')

In [18]:
pivot_table.to_excel('sales_summary.xlsx')